In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
course_name = {'a':['Data Science'],
       'b':['Machine Learning'],
       'c':['Big Data'],
       'd':['Data Engineer']}

In [4]:
df = pd.DataFrame(course_name)

In [5]:
df

              a                 b         c              d
0  Data Science  Machine Learning  Big Data  Data Engineer

In [6]:
#loc is used for label-based indexing (selecting based on row and column labels).
#iloc is used for integer-location based indexing (selecting based on integer positions of rows and columns).

In [7]:
df

              a                 b         c              d
0  Data Science  Machine Learning  Big Data  Data Engineer

In [8]:
new_df = df.reindex([3,0,1,2])

In [9]:
new_df

              a                 b         c              d
3           NaN               NaN       NaN            NaN
0  Data Science  Machine Learning  Big Data  Data Engineer
1           NaN               NaN       NaN            NaN
2           NaN               NaN       NaN            NaN

In [10]:
new_df.loc[2]

a    NaN
b    NaN
c    NaN
d    NaN
Name: 2, dtype: object

In [11]:
new_df.iloc[2]

a    NaN
b    NaN
c    NaN
d    NaN
Name: 1, dtype: object

In [12]:
import numpy as np

In [13]:
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']

In [14]:
indices = [1,2,3,4,5,6]

In [15]:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [16]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.064692  0.830570  0.507088  0.750202  0.713983  0.577731
2  0.296609  0.794530  0.397270  0.298482  0.835077  0.791456
3  0.870071  0.645981  0.207787  0.560820  0.825349  0.041974
4  0.370181  0.711336  0.103917  0.091341  0.108537  0.606543
5  0.007658  0.748015  0.531343  0.112341  0.628388  0.834546
6  0.230619  0.072526  0.227160  0.628502  0.981374  0.495632

In [17]:
df1.mean()

column_1    0.306638
column_2    0.633826
column_3    0.329094
column_4    0.406948
column_5    0.682118
column_6    0.557980
dtype: float64

In [18]:
df1.replace(column_2,['new_column'])

NameError: name 'column_2' is not defined

In [19]:
#windows is set of values for calculating the all mathematical operations
#Types -1. rolling, 2.expandind, 3.statistic, 4.average windows

In [20]:
date2= pd.date_range( start= '2023-12-02' , end='2023-12-25')

In [21]:
date2

DatetimeIndex(['2023-12-02', '2023-12-03', '2023-12-04', '2023-12-05',
               '2023-12-06', '2023-12-07', '2023-12-08', '2023-12-09',
               '2023-12-10', '2023-12-11', '2023-12-12', '2023-12-13',
               '2023-12-14', '2023-12-15', '2023-12-16', '2023-12-17',
               '2023-12-18', '2023-12-19', '2023-12-20', '2023-12-21',
               '2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df_date = pd.DataFrame({'date2':date2})

In [23]:
df_date

        date2
0  2023-12-02
1  2023-12-03
2  2023-12-04
3  2023-12-05
4  2023-12-06
5  2023-12-07
6  2023-12-08
7  2023-12-09
8  2023-12-10
9  2023-12-11
10 2023-12-12
11 2023-12-13
12 2023-12-14
13 2023-12-15
14 2023-12-16
15 2023-12-17
16 2023-12-18
17 2023-12-19
18 2023-12-20
19 2023-12-21
20 2023-12-22
21 2023-12-23
22 2023-12-24
23 2023-12-25

In [24]:
df2= pd.DataFrame({"date" : ['2023-12-02' , '2023-12-03','2023-12-04']})

In [25]:
df2

         date
0  2023-12-02
1  2023-12-03
2  2023-12-04

In [26]:

df2['updated_date'] = pd.to_datetime(['2023-12-02' , '2023-12-03','2023-12-04'])

In [27]:
df2

         date updated_date
0  2023-12-02   2023-12-02
1  2023-12-03   2023-12-03
2  2023-12-04   2023-12-04

In [28]:
df2['year'] = df2['updated_date'].dt.year

In [29]:
df2

         date updated_date  year
0  2023-12-02   2023-12-02  2023
1  2023-12-03   2023-12-03  2023
2  2023-12-04   2023-12-04  2023

In [30]:
pd.Timedelta(days= 2 , hours = 6 , minutes = 56 )

Timedelta('2 days 06:56:00')

In [31]:
dt = pd.to_datetime('2023-12-02')

In [32]:
td = pd.Timedelta(days = 3)

In [33]:
dt+td

Timestamp('2023-12-05 00:00:00')

In [34]:
def convert_to_categorical(df,'column_name','category_order'):
    df[column_name] = pd.Categorical(df['column_name'], categories=['category_order'], ordered=True)
    return df

SyntaxError: invalid syntax (3545602154.py, line 1)

In [35]:
 df = convert_to_categorical(df, column_name, category_order)

NameError: name 'convert_to_categorical' is not defined

In [36]:
sales_data = {'may': 80 ,'june':78,'july':74,'aug':70}

In [37]:
new_data = pd.DataFrame(sales_data,index=[1])

In [43]:
new_data

   may  june  july  aug
1   80    78    74   70

In [78]:
new_data.to_csv('sales.csv',index=True)

In [87]:
student_data = {1:85,2:90,3:80,4:75,5:85,6:82,7:78,8:85,9:90,10:85}

In [88]:
df4 = pd.DataFrame(stutdent_data)

In [92]:
df4

    0
0  80
1  82
2  85
3  90
4  75
5  78

In [93]:
df4.mean()

0    81.666667
dtype: float64

In [94]:
df4.median()

0    81.0
dtype: float64

In [ ]:
df4.mode